Revit 2027 API
FabricationConfiguration.GetService Method
 Get the service based on the service identifier from the fabrication configuration in the current document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricationService GetService(
	int serviceId
)
Public Function GetService (
	serviceId As Integer
) As FabricationService
public:
FabricationService^ GetService(
	int serviceId
)
member GetService :
        serviceId : int -> FabricationService
Parameters
serviceId Int32
 The service identifier.
Return Value
FabricationService
 The service based on the service identifier.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace